<a href="https://colab.research.google.com/github/rafaelrafaelfer/Pandas-Data/blob/main/Trabalhando_com_Datas_em_Planilhas_do_Excel_no_Pandas_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
df1 = pd.read_excel("Aracaju.xlsx")
df2 = pd.read_excel("Fortaleza.xlsx")
df3 = pd.read_excel("Natal.xlsx")
df4 = pd.read_excel("Recife.xlsx")
df5 = pd.read_excel("Salvador.xlsx")

In [4]:
df = pd.concat([df1, df2, df3, df4, df5])

In [5]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [6]:
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [7]:
df.sample(15)

        Cidade       Data  Vendas  LojaID  Qtde
105    Aracaju 2018-01-01   24.81    1520     5
49     Aracaju 2018-01-01   53.74    1522     3
227      Natal 2019-01-02   14.70    1035     1
91    Salvador 2019-01-01   17.74    1035     1
90     Aracaju 2018-01-01   16.27    1522     1
78     Aracaju 2018-01-01  154.85    1522     9
123    Aracaju 2018-01-01  115.19    1523     6
60   Fortaleza 2019-01-01  182.14    1002     4
193      Natal 2019-01-02    3.97    1036     2
51   Fortaleza 2019-01-01   30.47    1005     3
173      Natal 2019-01-02   31.77    1034     2
129    Aracaju 2018-01-01   13.70    1522     6
119   Salvador 2019-03-02  136.37    1034     2
83       Natal 2019-01-02   63.66    1036     2
3      Aracaju 2018-01-01    3.01    1521     7

In [8]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [9]:
df["LojaID"] = df["LojaID"].astype("object")

In [10]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [11]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

In [12]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [13]:
df["Vendas"].fillna(df['Vendas'].mean(), inplace=True)

In [14]:
df["Vendas"].mean()

122.61180089485438

In [15]:
df.sample(15)

       Cidade       Data  Vendas LojaID  Qtde
85      Natal 2019-01-02   16.88   1035     3
192     Natal 2019-01-02  166.51   1036     1
46     Recife 2019-01-01  239.17    981     8
127     Natal 2019-01-02  240.61   1035     3
191  Salvador 2019-01-02  173.59   1034     2
171  Salvador 2019-01-02  136.45   1035     3
208     Natal 2019-01-02   39.40   1036     3
162  Salvador 2019-01-02   23.08   1036     2
219     Natal 2019-01-02   19.67   1037     2
10     Recife 2019-01-01   38.51    982     8
145  Salvador 2019-01-02   84.62   1034     2
32    Aracaju 2018-01-01   42.97   1522     6
26      Natal 2018-07-20  370.00    853     3
115   Aracaju 2018-01-01   50.99   1522    10
204     Natal 2019-01-02  151.41   1037     2

In [16]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [17]:
df["Vendas"].fillna(0, inplace=True)

In [18]:
df.dropna(inplace=True)

In [19]:
df.dropna(subset=["Vendas"], inplace=True)

In [20]:
df.dropna(how="all", inplace=True)

In [21]:
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [22]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [23]:
df["Receitas/Vendas"] = df["Receita"] / df["Vendas"]

In [24]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receitas/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00              1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26              6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55              1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07              7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08              8.0

In [25]:
df["Receita"].max()

3544.0

In [26]:
df["Receita"].min()

3.34

In [27]:
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receitas/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0              4.0
51  Natal 2018-01-21   859.0    852     4   3436.0              4.0
55  Natal 2019-01-08   859.0    854     4   3436.0              4.0

In [28]:
df.nsmallest(4,"Receita")

       Cidade       Data  Vendas LojaID  Qtde  Receita  Receitas/Vendas
118   Aracaju 2018-01-01    3.34   1522     1     3.34              1.0
65     Recife 2019-01-01    4.01    981     1     4.01              1.0
92      Natal 2019-01-02    4.57   1035     1     4.57              1.0
92   Salvador 2019-01-01    4.57   1035     1     4.57              1.0

In [29]:
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [30]:
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receitas/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0              4.0
55  Natal 2019-01-08   859.0    854     4   3436.0              4.0
51  Natal 2018-01-21   859.0    852     4   3436.0              4.0
30  Natal 2018-10-02   856.0    853     4   3424.0              4.0
41  Natal 2018-05-20   835.0    852     4   3340.0              4.0
38  Natal 2018-02-25   828.0    852     4   3312.0              4.0
10  Natal 2018-10-27   828.0    852     4   3312.0              4.0
69  Natal 2019-03-24   817.0    852     4   3268.0              4.0
62  Natal 2018-02-10   793.0    854     4   3172.0              4.0
52  Natal 2018-04-27   778.0    854     4   3112.0              4.0

In [31]:
df['Data'] = df['Data'].astype('int64')

In [32]:
df.dtypes

Cidade              object
Data                 int64
Vendas             float64
LojaID              object
Qtde                 int64
Receita            float64
Receitas/Vendas    float64
dtype: object

In [33]:
df['Data'] = pd.to_datetime(df['Data'])

In [34]:
df.dtypes

Cidade                     object
Data               datetime64[ns]
Vendas                    float64
LojaID                     object
Qtde                        int64
Receita                   float64
Receitas/Vendas           float64
dtype: object

In [35]:
df.groupby(df['Data'].dt.year)['Receita'].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [36]:
df["Ano_Venda"] = df["Data"].dt.year

In [37]:
df.sample(5)

        Cidade       Data  Vendas  ... Receita  Receitas/Vendas  Ano_Venda
28   Fortaleza 2019-01-01   34.88  ...  104.64              3.0       2019
49     Aracaju 2018-01-01   53.74  ...  161.22              3.0       2018
232   Salvador 2019-01-03  167.76  ...  503.28              3.0       2019
54    Salvador 2019-01-01   46.54  ...  139.62              3.0       2019
29    Salvador 2019-01-01    9.27  ...    9.27              1.0       2019

[5 rows x 8 columns]

In [38]:
df['mes_venda'], df['dia_venda'] = (df["Data"].dt.month, df["Data"].dt.day)

In [39]:
df.sample(10)

        Cidade       Data  Vendas  ... Ano_Venda  mes_venda  dia_venda
70   Fortaleza 2019-01-01   79.57  ...      2019          1          1
109     Recife 2019-03-02   18.90  ...      2019          3          2
175      Natal 2019-01-02   16.53  ...      2019          1          2
96      Recife 2019-01-01  165.36  ...      2019          1          1
112     Recife 2019-03-02  133.59  ...      2019          3          2
55       Natal 2019-01-08  859.00  ...      2019          1          8
209      Natal 2019-01-02   69.98  ...      2019          1          2
15    Salvador 2019-01-01   20.15  ...      2019          1          1
119  Fortaleza 2019-03-02  152.30  ...      2019          3          2
138  Fortaleza 2019-03-02  150.38  ...      2019          3          2

[10 rows x 10 columns]

In [40]:
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [41]:
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [42]:
df.sample(10)

        Cidade       Data  Vendas  ... mes_venda  dia_venda  diferenca_dias
102     Recife 2019-01-01   96.50  ...         1          1        365 days
119     Recife 2019-03-02  152.30  ...         3          2        425 days
192      Natal 2019-01-02  166.51  ...         1          2        366 days
116      Natal 2019-01-02   41.78  ...         1          2        366 days
172      Natal 2019-01-02    6.70  ...         1          2        366 days
14       Natal 2018-06-03  660.00  ...         6          3        153 days
135  Fortaleza 2019-03-02   10.79  ...         3          2        425 days
23       Natal 2019-02-14  304.00  ...         2         14        409 days
31     Aracaju 2018-01-01  171.16  ...         1          1          0 days
123      Natal 2019-01-02  127.45  ...         1          2        366 days

[10 rows x 11 columns]

In [43]:
df["trimestre_venda"] = df["Data"].dt.quarter

In [44]:
df.sample(5)

       Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
57    Aracaju 2018-01-01   23.49  ...         1          0 days                1
7      Recife 2019-02-11   33.37  ...        11        406 days                1
126    Recife 2019-03-02   41.87  ...         2        425 days                1
161     Natal 2019-01-02    5.80  ...         2        366 days                1
25   Salvador 2019-01-01  220.62  ...         1        365 days                1

[5 rows x 12 columns]

In [45]:
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [46]:
vendas_marco_19.sample(20)

        Cidade       Data  Vendas  ... dia_venda  diferenca_dias  trimestre_venda
117  Fortaleza 2019-03-02   15.42  ...         2        425 days                1
108     Recife 2019-03-02  152.89  ...         2        425 days                1
115  Fortaleza 2019-03-02   12.23  ...         2        425 days                1
112     Recife 2019-03-02  133.59  ...         2        425 days                1
124  Fortaleza 2019-03-02   47.98  ...         2        425 days                1
126   Salvador 2019-03-02   41.69  ...         2        425 days                1
136   Salvador 2019-03-02   13.81  ...         2        425 days                1
138   Salvador 2019-03-02  212.03  ...         2        425 days                1
120     Recife 2019-03-02  184.90  ...         2        425 days                1
109   Salvador 2019-03-02  124.37  ...         2        425 days                1
119  Fortaleza 2019-03-02  152.30  ...         2        425 days                1
82       Natal 2019-03-07  868.00  ...         7        430 days                1
50       Natal 2019-03-08  324.00  ...         8        431 days                1
46       Natal 2019-03-26  753.00  ...        26        449 days                1
112   Salvador 2019-03-02   43.00  ...         2        425 days                1
140     Recife 2019-03-02  166.89  ...         2        425 days                1
135     Recife 2019-03-02   10.79  ...         2        425 days                1
122   Salvador 2019-03-02   13.27  ...         2        425 days                1
128   Salvador 2019-03-02   36.84  ...         2        425 days                1
139     Recife 2019-03-02  141.16  ...         2        425 days                1

[20 rows x 12 columns]